app/controllers/dogs_controller.rb

	def create
		@dog = Dog.create(dog_params)
---
INSERT INTO "dogs" ("created_at", "dog_age", "dog_name", "dog_picture", "updated_at") VALUES (?, ?, ?, ?, ?)